Feature: Резервиране на апартамент

  Scenario: Успешно резервиране на свободен апартамент
    Given Потребител отваря обява на апартамент с id 2
    And Потребителят въвежда дата "20.07.2026"
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява форма за влизане
    When Потребителят въвежда юзернейм "username1"
    And Потребителят въвежда парола "password1"
    And Потребителят натиска бутона Влез
    And Потребителят натисне бутона за резервиране
    Then На екрана се появява "Успешна заявка"


  Scenario: Резервиране на зает апартамент
    Given Потребител отваря обява на апартамент с id 1
    And Потребителят въвежда дата "20.07.2026"
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява "Апартамент е зает"

  Scenario: Резервиране без въведена дата
    Given Потребител отваря обява на апартамент с id 2
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява "Не е въведена дата"

  Scenario: Резервиране без регистрация
    Given Потребител отваря обява на апартамент с id 2
    And Потребителят въвежда дата "20.07.2026"
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява форма за влизане
    When Потребителят въвежда юзернейм "username3"
    And Потребителят въвежда парола "password3"
    And Потребителят натиска бутона Влез
    Then На екрана се появява "Не съществуващи данни. Създайте профил"

  Scenario: Резервиране с грешна парола
    Given Потребител отваря обява на апартамент с id 2
    And Потребителят въвежда дата "20.07.2026"
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява форма за влизане
    When Потребителят въвежда юзернейм "hgrigorii"
    And Потребителят въвежда парола "password3"
    And Потребителят натиска бутона Влез
    Then На екрана се появява "Грешна парола"

  Scenario: Резервиране с невалидна дата
    Given Потребител отваря обява на апартамент с id 2
    And Потребителят въвежда дата "32.07.2026"
    When Потребителят натисне бутона за резервиране
    Then На екрана се появява "Грешна дата"