Feature: Добавяне на апартамент

  Scenario: Успешно добавяне на апартамент
    Given Потребителят с id 2 отваря сайта
    And Натиска бутона за добавяне на апартамент
    And Попълва цена "100"
    And Добавя град "Пловдив"
    And Добавя снимка "https://example3.com"
    When Потребителят натиска бутона Post
    Then На екрана се появява "Обявата е публикувана успешно".

  Scenario: Опит добавяне на апартамент без снимки
    Given Потребителят с id 2 отваря сайта
    And Натиска бутона за добавяне на апартамент
    And Попълва цена "100"
    And Добавя град "Пловдив"
    When Потребителят натиска бутона Post
    Then На екрана се появява "Добавете снимка на апартамент".

  Scenario: Опит добавяне на апартамент без роля хост
    Given Потребителят с id 1 отваря сайта
    And Натиска бутона за добавяне на апартамент
    Then На екрана се появява "Кандидатствайте за HOST партньор".

  Scenario: Опит добавяне на апартамент с грешна цена
    Given Потребителят с id 2 отваря сайта
    And Натиска бутона за добавяне на апартамент
    And Попълва цена "-200"
    And Добавя град "София"
    And Добавя снимка "https://example3.com"
    When Потребителят натиска бутона Post
    Then На екрана се появява "Цената трябва да е по-голяма от 0".

  Scenario: Опит за добавяне на апартамент в неподдържан град
    Given Потребителят с id 2 отваря сайта
    And Натиска бутона за добавяне на апартамент
    And Попълва цена "100"
    And Добавя град "Барселона"
    And Добавя снимка "https://example3.com"
    When Потребителят натиска бутона Post
    But На екрана се появява "Неподдържан град".
    And Добавя град "София"
    When Потребителят натиска бутона Post
    Then На екрана се появява "Обявата е публикувана успешно".



