Feature: Търсене на апартамент
  Scenario: Търсене на апартамент по град с успешен резултат
    Given Потребител отваря екрана за търсене на апартамент
    When потребителя въвведе град "Пловдив"
    And Натисне бутона за търсене
    Then На екрана се появява 1 запис
    And Град на апартамент е "Пловдив"

  Scenario: Търсене на апартамент по град без резултат
    Given Потребител отваря екрана за търсене на апартамент
    When потребителя въвведе град "Барселона"
    And Натисне бутона за търсене
    Then На екрана се появява 0 запис

  Scenario: Търсене на апартамент без филтри с успешен резултат
    Given Потребител отваря екрана за търсене на апартамент
    And Натисне бутона за търсене
    Then На екрана се появява 2 запис

  Scenario: Търсене на свободен апартамент с успешен резултат
    Given Потребител отваря екрана за търсене на апартамент
    And Натисне бутона за търсене
    Then На екрана се появява 2 запис
    And Статус на апартамент е "Свободен"

  Scenario: Търсене на свободен апартамент по град и район с успешен резултат
    Given Потребител отваря екрана за търсене на апартамент
    When потребителя въвведе град "Пловдив"
    When потребителя въвведе район "Кършияка"
    And Натисне бутона за търсене
    Then На екрана се появява 1 запис
    And Град на апартамент е "Пловдив"
    And Статус на апартамент е "Зает"
