Feature: Търсене на апартамент
  Background:
    Given Потребител отваря екрана за търсене на апартамент

  Scenario: Търсене на апартамент по град с успешен резултат
    When потребителя въвведе град "Пловдив"
    And Натисне бутона за търсене
    Then На екрана се появява 2 запис
    And Град на апартамент е "Пловдив"

  Scenario: Търсене на апартамент по град без резултат
    When потребителя въвведе град "Барселона"
    And Натисне бутона за търсене
    Then На екрана се появява 0 запис

  Scenario: Търсене на апартамент без филтри с успешен резултат
    And Натисне бутона за търсене
    Then На екрана се появява 3 запис

  Scenario: Търсене на свободен апартамент с успешен резултат
    When потребителя избира филтър "Свободен"
    And Натисне бутона за търсене
    Then На екрана се появява 2 запис
    And Статус на апартамент е "Свободен"

  Scenario: Търсене на апартамент по град и район с успешен резултат
    When потребителя въвведе град "София"
    And потребителя въвведе район "Младост"
    And Натисне бутона за търсене
    Then На екрана се появява 1 запис
    And Град на апартамент е "София"
    And Район на апартамент е "Младост"
    And Статус на апартамент е "Зает"



